[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.jsx:8:31
 import { toast } from "react-toastify";
 
 export default function UCSBDiningCommonsMenuItemCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (ucsbDiningCommonsMenuItem) => ({
-    url: "/api/ucsb-dining-commons-menu-items/post",
-    method: "POST",
-    params: {
-      name: ucsbDiningCommonsMenuItem.name,
-      diningCommonsCode: ucsbDiningCommonsMenuItem.diningCommonsCode,
-      station: ucsbDiningCommonsMenuItem.station,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (ucsbDiningCommonsMenuItem) => {
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /ucsb-dining-commons-menu-items
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.jsx:18:52
     },
   });
 
-  const onSuccess = (ucsbDiningCommonsMenuItem) => {
-    toast(
-      `New menu item Created - id: ${ucsbDiningCommonsMenuItem.id} name: ${ucsbDiningCommonsMenuItem.name}`,
-    );
-  };
+  const onSuccess = (ucsbDiningCommonsMenuItem) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /ucsb-dining-commons-menu-items
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0
