[Killed] BlockStatement
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.jsx:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/ucsb-dining-commons-menu-items/edit/${cell.row.original.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UCSBDiningCommonsMenuItemTable tests Edit button navigates to the edit page
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.jsx:53:5
       accessorKey: "diningCommonsCode",
     },
 
-    {
-      header: "Station",
-      accessorKey: "station",
-    },
+    {},
   ];
 
killedBy: UCSBDiningCommonsMenuItemTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header
